# YOLOv11n RGBT configuration for KAIST multispectral pedestrian detection
# ref: https://github.com/ultralytics/ultralytics/blob/main/ultralytics/cfg/models/11/yolo11.yaml

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv11 (+RGBT) backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]],    # 1-P2/4
    [-1, 2, MultiStreamC3k2, [256, False, 0.25]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]],               # 5-P3/8
    [-1, 2, C3k2, [512, False, 0.25]],
    [-1, 1, Conv, [512, 3, 2]],               # 7-P4/16
    [-1, 2, C3k2, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]],              # 9-P5/32
    [-1, 2, C3k2, [1024, True]],
    [-1, 1, SPPF, [1024, 5]],
    [-1, 2, C2PSA, [1024]],                   # 12
  ]

# YOLOv11 (+RGBT) head
head: [
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 8], 1, Concat, [1]],                # cat backbone P4
    [-1, 2, C3k2, [512, False]],              # 15

    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],                # cat backbone P3
    [-1, 2, C3k2, [256, False]],              # 18 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 15], 1, Concat, [1]],               # cat head P4
    [-1, 2, C3k2, [512, False]],              # 21 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 12], 1, Concat, [1]],               # cat head P5
    [-1, 3, C3, [1024, False]],               # 24 (P5/32-large)

    [[18, 21, 24], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
