# YOLOv11n RGBT configuration for KAIST multispectral pedestrian detection
# ref: https://github.com/ultralytics/ultralytics/blob/main/ultralytics/cfg/models/11/yolo11.yaml

# Parameters
nc: 1 # number of classes
depth_multiple: 0.67
width_multiple: 0.75
anchors:
  - [16, 32, 20, 48, 26, 58]        # P3/8
  - [35, 76, 68, 52, 44, 98]        # P4/16
  - [54, 128, 180, 48, 72, 176]     # P5/32

# YOLOv11 (+RGBT) backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]],    # 1-P2/4
    [-1, 2, MultiStreamC3, [256]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 3, 2]],               # 4-P3/8
    [-1, 2, C3k2, [512, False]],
    [-1, 1, Conv, [512, 3, 2]],               # 6-P4/16
    [-1, 2, C3k2, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]],              # 8-P5/32
    [-1, 2, C2PSA, [1024]],
    [-1, 1, SPPF, [1024, 5]],                 # 10
  ]

# YOLOv11 (+RGBT) head
head: [
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]],                # cat backbone P4
    [-1, 2, C3k2, [512, False]],              # 13

    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]],                # cat backbone P3
    [-1, 2, C3k2, [256, False]],              # 16 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 13], 1, Concat, [1]],               # cat head P4
    [-1, 2, C3k2, [512, False]],              # 19 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]],               # cat head P5
    [-1, 2, C3k2, [1024, True]],              # 22 (P5/32-large)

    [[16, 19, 22], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
